# Making Database Connections
This notebook gives you brief overview of how to make remote connections to a database server.  This assumes you have install SQLAlchemy and pymysql which you can install at the command-line with pip install.

In [14]:
from sqlalchemy import create_engine
import pymysql
import pandas as pd

Sets up the connection parameters that are necessary to connect to a local database server.

In [2]:
sqlEngine = create_engine('mysql+pymysql://pythonapp:letmein@localhost:3306/premier_products')

Makes the actual connection to the database. Error code would go here if you need it.

In [15]:
dbConnection    = sqlEngine.connect()

Define the query to run on the server.

In [4]:
q1 = "SELECT customer_num, customer_name FROM premier_products.customer"

Execute the query use pandas.read_sql() function - this put the results into a pandas dataframe.

In [5]:
products = pd.read_sql(q1, dbConnection);

In [6]:
products.head()

  customer_num             customer_name
0          148  Al's Appliance and Sport
1          282          Brookings Direct
2          356                Ferguson's
3          408       The Everything Shop
4          462           Bargains Galore

It's good form to close the connection when you are done so it doesn't  leak memory resources.

In [17]:
dbConnection.close()

The following code works the same, except it is for a remote database server. To use this code, you have to be on the same network as the server.

In [18]:
sqlEngine = create_engine('mysql+pymysql://pollution:Spring#2022@10.101.1.101:3306/pollution')

In [19]:
dbConnection    = sqlEngine.connect()

In [20]:
df = pd.read_sql("SELECT average_value, instrument_status FROM pollution.measurement WHERE station_code=101 AND instrument_status=1", dbConnection);

In [21]:
df

      average_value  instrument_status
0             0.051                  1
1             0.007                  1
2             6.000                  1
3             0.014                  1
4           143.000                  1
...             ...                ...
1011         -1.000                  1
1012          0.007                  1
1013          0.063                  1
1014         25.000                  1
1015         13.000                  1

[1016 rows x 2 columns]

In [22]:
dbConnection.close()